In [1]:
import numpy as np
import pandas as pd

In [2]:
csvframe = pd.read_csv('ch05_01.csv')
csvframe

   white  red  blue  green animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1  mouse

In [3]:
pd.read_table('ch05_01.csv',sep=',')

   white  red  blue  green animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1  mouse

In [4]:
pd.read_csv('ch05_02.csv')

   1  5  2  3    cat
0  2  7  8  5    dog
1  3  3  6  7  horse
2  2  2  8  3   duck
3  4  4  2  1  mouse

In [5]:
pd.read_csv('ch05_02.csv', header=None)

   0  1  2  3      4
0  1  5  2  3    cat
1  2  7  8  5    dog
2  3  3  6  7  horse
3  2  2  8  3   duck
4  4  4  2  1  mouse

In [6]:
pd.read_csv('ch05_02.csv', names=['white','red','blue','green','animal'])

   white  red  blue  green animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1  mouse

In [7]:
pd.read_csv('ch05_03.csv', index_col=['color','status'])

              item1  item2  item3
color status
black up          3      4      6
      down        2      6      7
white up          5      5      5
      down        3      3      2
      left        1      2      1
red   up          2      2      2
      down        1      1      4

# Using RegExp to Parse TXT Files

In [8]:
pd.read_table('ch05_04.txt',sep='\s+', engine='python')

   white  red  blue  green
0      1    5     2      3
1      2    7     8      5
2      3    3     6      7

In [9]:
pd.read_table('ch05_05.txt', sep='\D+', header=None, engine='python')

   0    1    2
0  0  123  122
1  1  124  321
2  2  125  333

In [10]:
pd.read_table('ch05_06.txt',sep=',',skiprows=[0,1,3,6])

   white  red  blue  green animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1  mouse

# Reading TXT Files Into Parts

In [11]:
pd.read_csv('ch05_02.csv',skiprows=[2],nrows=3,header=None)

   0  1  2  3     4
0  1  5  2  3   cat
1  2  7  8  5   dog
2  2  2  8  3  duck

In [35]:
out = pd.Series(dtype='float64')
i = 0
pieces = pd.read_csv('ch05_01.csv',chunksize=3)
for piece in pieces:
   out.at[i] = piece['white'].sum()
   i = i + 1

In [36]:
out

0    6
1    6
dtype: int64

# Writing Data in CSV

In [ ]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)),
               index = ['red', 'blue', 'yellow', 'white'],
               columns = ['ball', 'pen', 'pencil', 'paper'])

In [ ]:
frame.to_csv('ch05_07.csv')

In [ ]:
frame.to_csv('ch05_07b.csv', index=False, header=False)

In [37]:
frame2 = pd.DataFrame([[6,np.nan,np.nan,6,np.nan],
              [np.nan,np.nan,np.nan,np.nan,np.nan],
              [np.nan,np.nan,np.nan,np.nan,np.nan],
              [20,np.nan,np.nan,20.0,np.nan],
              [19,np.nan,np.nan,19.0,np.nan]
             ],
                     index=['blue','green','red','white','yellow'],
                     columns=['ball','mug','paper','pen','pencil'])
frame2

        ball  mug  paper   pen  pencil
blue     6.0  NaN    NaN   6.0     NaN
green    NaN  NaN    NaN   NaN     NaN
red      NaN  NaN    NaN   NaN     NaN
white   20.0  NaN    NaN  20.0     NaN
yellow  19.0  NaN    NaN  19.0     NaN

In [38]:
frame2.to_csv('ch05_08.csv')

In [39]:
frame2.to_csv('ch05_09.csv', na_rep ='NaN')

# Reading and Writing HTML Files

In [15]:
frame = pd.DataFrame(np.arange(4).reshape(2,2))

In [16]:
print(frame.to_html())

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>0</td>
      <td>1</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2</td>
      <td>3</td>
    </tr>
  </tbody>
</table>

In [17]:
frame = pd.DataFrame( np.random.random((4,4)),
                 index = ['white','black','red','blue'],
                 columns = ['up','down','right','left'])
frame

             up      down     right      left
white  0.841905  0.532733  0.564770  0.967375
black  0.737313  0.720684  0.688307  0.185230
red    0.731798  0.094607  0.077618  0.747642
blue   0.835116  0.934555  0.286050  0.316893

In [18]:
s = ['<HTML>']
s.append('<HEAD><TITLE>My DataFrame</TITLE></HEAD>')
s.append('<BODY>')
s.append(frame.to_html())
s.append('</BODY></HTML>')
html = ''.join(s)

In [19]:
html_file = open('myFrame.html','w')
html_file.write(html)
html_file.close()

# Reading Data from an HTML File

In [20]:
web_frames = pd.read_html('myFrame.html')
web_frames[0]

  Unnamed: 0        up      down     right      left
0      white  0.841905  0.532733  0.564770  0.967375
1      black  0.737313  0.720684  0.688307  0.185230
2        red  0.731798  0.094607  0.077618  0.747642
3       blue  0.835116  0.934555  0.286050  0.316893

In [21]:
ranking = pd.read_html('https://www.meccanismocomplesso.org/en/meccanismo-complesso-sito-2/classifica-punteggio/')
ranking[0]

     Unnamed: 0        Member  Points  Levels
0             1   BrunoOrsini    2075     NaN
1             2     Berserker     700     NaN
2             3  albertosallu     275     NaN
3             4           Jon     180     NaN
4             5          Mr.Y     180     NaN
..          ...           ...     ...     ...
110         111  Gigi Bertana       5     NaN
111         112       p.barut       5     NaN
112         113  Indri4Africa       5     NaN
113         114     ghirograf       5     NaN
114         115  Marco Corbet       5     NaN

[115 rows x 4 columns]

# Reading Data from XML

In [46]:
from lxml import objectify

In [47]:
xml = objectify.parse('books.xml')
xml

In [48]:
root = xml.getroot()

In [49]:
root.Book.Author

'Ross, Mark'

In [50]:
root.Book.PublishDate

'2014-22-01'

In [51]:
root.getchildren()

In [52]:
[child.tag for child in root.Book.getchildren()]

['Author', 'Title', 'Genre', 'Price', 'PublishDate']

In [53]:
[child.text for child in root.Book.getchildren()]

['Ross, Mark', 'XML Cookbook', 'Computer', '23.56', '2014-22-01']

In [61]:
def etree2df(root):
    column_names = []
    for i in range(0,len(root.getchildren()[0].getchildren())):
       column_names.append(root.getchildren()[0].getchildren()[i].tag)
    xml_frame = pd.DataFrame(columns=column_names)
    for j in range(0, len(root.getchildren())):
       obj = root.getchildren()[j].getchildren()
       texts = []
       for k in range(0, len(column_names)):
          texts.append(obj[k].text)
       row = dict(zip(column_names, texts))
       row_s = pd.Series(row)
       row_s.name = j
       xml_frame = pd.concat([xml_frame, row_s.to_frame().T], ignore_index=True)
    return xml_frame

etree2df(root)

             Author            Title     Genre  Price PublishDate
0        Ross, Mark     XML Cookbook  Computer  23.56  2014-22-01
1  Bracket, Barbara  XML for Dummies  Computer  35.95  2014-12-16

# Reading and Writing Data on Microsoft Excel Files

In [ ]:
#   conda install openpyxl

In [63]:
pd.read_excel('ch05_data.xlsx')

  Unnamed: 0  white  red  green  black
0          a     12   23     17     18
1          b     22   16     19     18
2          c     14   23     22     21

In [64]:
pd.read_excel('ch05_data.xlsx','Sheet2')

  Unnamed: 0  yellow  purple  blue  orange
0          A      11      16    44      22
1          B      20      22    23      44
2          C      30      31    37      32

In [65]:
pd.read_excel('ch05_data.xlsx',1)

  Unnamed: 0  yellow  purple  blue  orange
0          A      11      16    44      22
1          B      20      22    23      44
2          C      30      31    37      32

In [66]:
frame = pd.DataFrame(np.random.random((4,4)),
                     index = ['exp1','exp2','exp3','exp4'],
                     columns = ['Jan2015','Fab2015','Mar2015','Apr2005'])
frame

       Jan2015   Fab2015   Mar2015   Apr2005
exp1  0.843652  0.402761  0.033565  0.177894
exp2  0.058676  0.689798  0.220878  0.078390
exp3  0.303273  0.445341  0.191478  0.740567
exp4  0.578395  0.027770  0.040025  0.388212

In [67]:
frame.to_excel('ch05_data2.xlsx')

# JSON

In [68]:
frame = pd.DataFrame(np.arange(16).reshape(4,4),
                      index=['white','black','red','blue'],
                      columns=['up','down','right','left'])
frame.to_json('frame.json')

In [69]:
pd.read_json('frame.json')

       up  down  right  left
white   0     1      2     3
black   4     5      6     7
red     8     9     10    11
blue   12    13     14    15

In [70]:
from pandas.io.json import json_normalize
import pandas.io.json as json

In [97]:
file = open('books.json','r')
text = file.read()
text = json.loads(text)
text

[{'writer': 'Mark Ross',
  'nationality': 'USA',
  'books': [{'title': 'XML Cookbook', 'price': 23.56},
   {'title': 'Python Fundamentals', 'price': 50.7},
   {'title': 'The NumPy library', 'price': 12.3}]},
 {'writer': 'Barbara Bracket',
  'nationality': 'UK',
  'books': [{'title': 'Java Enterprise', 'price': 28.6},
   {'title': 'HTML5', 'price': 31.35},
   {'title': 'Python for Dummies', 'price': 28.0}]}]

In [73]:
pd.json_normalize(text,'books')

                 title  price
0         XML Cookbook  23.56
1  Python Fundamentals  50.70
2    The NumPy library  12.30
3      Java Enterprise  28.60
4                HTML5  31.35
5   Python for Dummies  28.00

In [75]:
pd.json_normalize(text,'books',['writer','nationality'])

                 title  price           writer nationality
0         XML Cookbook  23.56        Mark Ross         USA
1  Python Fundamentals  50.70        Mark Ross         USA
2    The NumPy library  12.30        Mark Ross         USA
3      Java Enterprise  28.60  Barbara Bracket          UK
4                HTML5  31.35  Barbara Bracket          UK
5   Python for Dummies  28.00  Barbara Bracket          UK

# The Format HDF5

In [ ]:
###   conda install pytables

In [98]:
from pandas.io.pytables import HDFStore

In [102]:
frame = pd.DataFrame(np.arange(16).reshape(4,4),
                     index=['white','black','red','blue'],
                     columns=['up','down','right','left'])

In [103]:
store = HDFStore('mydata.h5')
store['obj1'] = frame

frame

       up  down  right  left
white   0     1      2     3
black   4     5      6     7
red     8     9     10    11
blue   12    13     14    15

In [105]:
store['obj2'] = frame
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [106]:
store['obj2']

       up  down  right  left
white   0     1      2     3
black   4     5      6     7
red     8     9     10    11
blue   12    13     14    15

# Pickle—Python Object Serialization

In [86]:
## !!!!!!!!!!!!!!!!!! CORREZIONE !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! ####

#import cPickle as pickle
import _pickle as pickle

In [87]:
data = { 'color': ['white','red'], 'value': [5, 7]}

In [88]:
pickled_data = pickle.dumps(data)

In [89]:
print(pickled_data)

b'\x80\x04\x95/\x00\x00\x00\x00\x00\x00\x00}\x94(\x8c\x05color\x94]\x94(\x8c\x05white\x94\x8c\x03red\x94e\x8c\x05value\x94]\x94(K\x05K\x07eu.'

In [90]:
nframe = pickle.loads(pickled_data)
nframe

{'color': ['white', 'red'], 'value': [5, 7]}

In [91]:
frame = pd.DataFrame(np.arange(16).reshape(4,4), index = ['up','down','left','right'])
frame.to_pickle('frame.pkl')

In [92]:
pd.read_pickle('frame.pkl')

        0   1   2   3
up      0   1   2   3
down    4   5   6   7
left    8   9  10  11
right  12  13  14  15

# Interacting with Databases

In [ ]:
###   conda install sqlalchemy

In [94]:
from sqlalchemy import create_engine

In [ ]:
#engine = create_engine('postgresql://scott:tiger@localhost:5432/mydatabase')

In [ ]:
#engine = create_engine('mysql+mysqldb://scott:tiger@localhost/foo')

In [ ]:
#engine = create_engine('oracle://scott:tiger@127.0.0.1:1521/sidname')

In [ ]:
#engine = create_engine('mssql+pyodbc://mydsn')

In [ ]:
#engine = create_engine('sqlite:///foo.db')

In [95]:
frame = pd.DataFrame( np.arange(20).reshape(4,5),
                       columns=['white','red','blue','black','green'])
frame

   white  red  blue  black  green
0      0    1     2      3      4
1      5    6     7      8      9
2     10   11    12     13     14
3     15   16    17     18     19

In [96]:
engine = create_engine('sqlite:///foo.db')

In [97]:
frame.to_sql('colors',engine)

ValueError: Table 'colors' already exists.

In [98]:
pd.read_sql('colors',engine)

   index  white  red  blue  black  green
0      0      0    1     2      3      4
1      1      5    6     7      8      9
2      2     10   11    12     13     14
3      3     15   16    17     18     19

In [99]:
import sqlite3
query = """
 CREATE TABLE test
 (a VARCHAR(20), b VARCHAR(20),
  c REAL,        d INTEGER
 );"""
con = sqlite3.connect(':memory:')
con.execute(query)
con.commit()

In [100]:
data = [('white','up',1,3),
         ('black','down',2,8),
         ('green','up',4,4),
         ('red','down',5,5)]
stmt = "INSERT INTO test VALUES(?,?,?,?)"
con.executemany(stmt, data)
con.commit()

In [101]:
cursor = con.execute('select * from test')
cursor
rows = cursor.fetchall()
rows

[('white', 'up', 1.0, 3),
 ('black', 'down', 2.0, 8),
 ('green', 'up', 4.0, 4),
 ('red', 'down', 5.0, 5)]

In [102]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [106]:
### !!!!!!!!!!!!!!!!!!! CORREZIONE !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
#pd.DataFrame(rows, columns=zip(*cursor.description)[0])
pd.DataFrame(rows, columns=next(zip(*cursor.description)))

       a     b    c  d
0  white    up  1.0  3
1  black  down  2.0  8
2  green    up  4.0  4
3    red  down  5.0  5

In [107]:
pd.__version__

'1.5.3'

# POSTGRES

In [ ]:
##   conda install psycopg2

In [107]:

import psycopg2
from sqlalchemy import create_engine
engine = create_engine('postgresql://myusername:mypassword@localhost:5432/postgres')

In [108]:
import pandas as pd
import numpy as np
frame = pd.DataFrame(np.random.random((4,4)),
              index=['exp1','exp2','exp3','exp4'],
              columns=['feb','mar','apr','may']);

In [109]:
frame.to_sql('dataframe',engine)

ValueError: Table 'dataframe' already exists.

In [110]:
pd.read_sql_table('dataframe',engine)

  index       feb       mar       apr       may
0  exp1  0.256446  0.536356  0.333538  0.738254
1  exp2  0.171628  0.475715  0.655618  0.760204
2  exp3  0.212392  0.518544  0.216459  0.267479
3  exp4  0.868340  0.850411  0.657050  0.253119

In [111]:
pd.read_sql_query('SELECT index,apr,may FROM DATAFRAME WHERE apr > 0.5',engine)

  index       apr       may
0  exp2  0.655618  0.760204
1  exp4  0.657050  0.253119

# Reading and Writing Data with a NoSQL Database: MongoDB

In [ ]:
## BISOGNA INSTALLARE pymongo !!!!!!!!!!!!!!!!!!!!! ######################
###   conda install pymongo

docker pull mongo
docker run --name mymongo -p 27017:27017 -d mongo

In [59]:
from pymongo import MongoClient

client = MongoClient('localhost',27017)

In [61]:
db = client.mydatabase
db

Database(MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True), 'mydatabase')

In [62]:
client['mydatabase']

Database(MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True), 'mydatabase')

In [115]:
collection = db.mycollection
db['mycollection']

Collection(Database(MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True), 'mydatabase'), 'mycollection')

In [92]:
collection

Collection(Database(MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True), 'mydatabase'), 'mycollection')

In [116]:
frame = pd.DataFrame( np.arange(20).reshape(4,5),
                      columns=['white','red','blue','black','green'])
frame

   white  red  blue  black  green
0      0    1     2      3      4
1      5    6     7      8      9
2     10   11    12     13     14
3     15   16    17     18     19

In [117]:
import json
record = json.loads(frame.T.to_json()).values()
record

dict_values([{'white': 0, 'red': 1, 'blue': 2, 'black': 3, 'green': 4}, {'white': 5, 'red': 6, 'blue': 7, 'black': 8, 'green': 9}, {'white': 10, 'red': 11, 'blue': 12, 'black': 13, 'green': 14}, {'white': 15, 'red': 16, 'blue': 17, 'black': 18, 'green': 19}])

In [118]:
collection.mydocument.insert_many(record)

In [114]:
#collection.mydocument.drop()

In [119]:
result = collection['mydocument'].find()
df = pd.DataFrame(list(result))
del df['_id']
df

   white  red  blue  black  green
0      0    1     2      3      4
1      5    6     7      8      9
2     10   11    12     13     14
3     15   16    17     18     19